/*
(i) Код попадает в итоговый файл,
только когда вызвана функция,
например flsFunctions.spollers();
Или когда импортирован весь файл,
например, import "files/script.js";
Неиспользование (не вызван)
код в итоговый файл не попадает.

Если мы хотим добавить модуль
следует его раскомментировать
*/

//Включить/выключить FLS (Full Logging System) (в работе)
window['FLS'] = false

// Подключение основного файла стилей
import '../scss/style.scss'

// ========================================================================================================================================================================================================================================================
// Функционал ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================
import * as flsFunctions from './files/functions.js'

/* Перевірка підтримки webp, додавання класу webp або no-webp для HTML */
/* (i) необхідно для коректного відображення webp із css */
flsFunctions.isWebp()
/* Додавання класу touch для HTML якщо браузер мобільний */
flsFunctions.addTouchClass()
/* Додавання loaded для HTML після повного завантаження сторінки */
flsFunctions.addLoadedClass()
/* Модуль для роботи з меню (Бургер) */
flsFunctions.menuInit()
/* Враховування плаваючої панелі на мобільних пристроях при 100vh */
// flsFunctions.fullVHfix();
/* Форматування чисел */
// import './libs/wNumb.min.js';

/*
Модуль "Спойлери"
Сніппет (HTML): spollers
*/
flsFunctions.spollers()

/*
Модуль "Таби"
Сніппет (HTML): tabs
*/
flsFunctions.tabs()

/*
Модуль "Показать еще"
Сніппет (HTML): showmore
*/
// flsFunctions.showMore()

/*
Модуль "Эффект волн"
Сниппет (HTML):
*/
// flsFunctions.rippleEffect();

/*
Модуль "Кастомний курсор"
Сниппет (HTML):
*/
// flsFunctions.customCursor(true)

/*
Модуль "Попап"
Сніппет (HTML): pl, pop
*/
import './libs/popup.js'

/*
Модуль паралаксу мишею
Документація: https://template.fls.guru/template-docs/modul-animacii-parallaks-obektov-pri-dvizhenii-myshi.html
*/
// import './libs/parallax-mouse.js'

// ========================================================================================================================================================================================================================================================
// Робота з формами ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================
// import * as flsForms from './files/forms/forms.js'

/* Робота c полями форми */
/* Документація: https://template.fls.guru/template-docs/rabota-s-formami.html */
/*
flsForms.formFieldsInit({
	viewPass: false,
	autoHeight: false
});
*/
/* Надсилання форми */
/* Документація: https://template.fls.guru/template-docs/rabota-s-formami.html */
// flsForms.formSubmit();

/* Модуль форми "кількість" */
// flsForms.formQuantity();

/* Модуль зіркового рейтингу */
// flsForms.formRating();

/* Модуль роботи з select. */
// import './libs/select.js'

/* Модуль роботи з календарем */
// import './files/forms/datepicker.js'

/* (У роботі) Модуль роботи з масками.*/
/*
Підключення та налаштування виконується у файлі js/files/forms/inputmask.js
Документація по роботі у шаблоні:
Документація плагіна: https://github.com/RobinHerbots/inputmask
Сніппет(HTML):
*/
// import "./files/forms/inputmask.js";

/* Модуль роботи з повзунком */
/*
Підключення та налаштування виконується у файлі js/files/forms/range.js
Документація по роботі у шаблоні:
Документація плагіна: https://refreshless.com/nouislider/
Сніппет (HTML): range
*/
// import "./files/forms/range.js";

/* Модуль роботи з підказками (tippy) */
/*
Підключення плагіна Tippy.js та налаштування виконується у файлі js/files/tippy.js
Документація по роботі у шаблоні:
Документація плагіна: https://atomiks.github.io/tippyjs/
Сніппет (HTML): tip (додає атрибут з підказкою для html тега)
*/
// import "./files/tippy.js";

// ========================================================================================================================================================================================================================================================
// Робота зі слайдером (Swiper) ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================
/*
Налаштування підключення плагіна слайдера Swiper та нових слайдерів виконується у файлі js/files/sliders.js
Документація плагіна: https://swiperjs.com/
Сніппет(HTML): swiper
*/
import './files/sliders.js'

// ========================================================================================================================================================================================================================================================
// Модулі роботи з прокручуванням сторінки ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================

/*
Зміна дизайну скроллбару
Документація по роботі у шаблоні: У HTML додаємо до блоку атрибут data-simplebar
Документація плагіна: https://github.com/Grsmto/simplebar/tree/master/packages/simplebar
Сніппет(HTML): 
*/
// import './files/scroll/simplebar.js';

// Ленивая (отложенная) загрузка картинок
// Документація плагіна: https://github.com/verlok/vanilla-lazyload
// Сніппет(HTML):
import './files/scroll/lazyload.js'

// Наблюдатель за объектами с атрибутом data-watch
// Сніппет(HTML):
// import './libs/watcher.js'

// Модуль поекранної прокрутки
// Сніппет(HTML):
// import './libs/fullpage.js'

// Модуль паралакса
// Сніппет(HTML):
// import './libs/parallax.js'

// Функции работы со скролом
import * as flsScroll from './files/scroll/scroll.js'

// Плавна навігація по сторінці
flsScroll.pageNavigation()

// Функционал добавления классов к хедеру во время прокрутки
// flsScroll.headerScroll();

// Анимация цифрового счетчика.
// Сніппет(HTML):
// flsScroll.digitsCounter();

// ========================================================================================================================================================================================================================================================
// Галерея ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================
/*
Документация по работе в шаблоне:
Документация плагина: https://www.lightgalleryjs.com/docs/
Сниппет(HTML):
*/
// import './files/gallery.js'

// ========================================================================================================================================================================================================================================================
// Масонри сетка ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================

// import "./files/isotope.js";

// Сетка с ровным краем
// import './libs/masonry.js'

// ========================================================================================================================================================================================================================================================
// Інші плагіни ============================================================================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================

/* Динамический адаптив */
// Документація: https://template.fls.guru/template-docs/dinamicheskij-adaptiv.html
import './libs/dynamic_adapt.js'

// ========================================================================================================================================================================================================================================================
// Інше ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================
/* Подключаем файлы со своим кодом */
import './files/script.js'
//============================================================================================================================================================================================================================================
